Autodesk.Revit.DB.RoutingPreferenceManager.GetMEPPartId(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingConditions)
Gets a fitting or segment id of given routing preference group that meets the specified routing conditions.
groupType:
The routing preference group
conditions:
A set of routing conditions
Returns:
The Id of the fitting or segment that met the given routing conditions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule,System.Int32)
Adds a new routing preference rule to the specified position in the rule group.
groupType:
The routing preference group type in which the rule should be added.
rule:
The new rule to be added.
index:
The zero-based index position where the new rule will be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is not a valid zero-based index within groupType.
-or-
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.RoutingPreferenceManager.AddRule(Autodesk.Revit.DB.RoutingPreferenceRuleGroupType,Autodesk.Revit.DB.RoutingPreferenceRule)
Adds a new routing preference rule to the rule group.
groupType:
The routing preference group in which the rule should be added.
rule:
The new rule to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rule cannot be added to the groupType.
-or-
Thrown if the index is out of bounds, or the rule is not valid for this group (e.g. an elbow may not be added to the junction group).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013